{"id":160,"date":"2019-08-22T20:08:31","dateGmt":"2019-08-22T17:08:31","guid":{"rendered":"http://wordpress.loc/?p=160"},"modified":"2019-08-25T07:03:32","modifiedGmt":"2019-08-25T04:03:32","slug":"%d1%87%d1%82%d0%be-%d1%82%d0%b0%d0%ba%d0%be%d0%b5-%d1%81%d1%82%d0%b0%d1%82%d0%b8%d1%87%d0%b5%d1%81%d0%ba%d0%b8%d0%b9-%d1%81%d0%b0%d0%b9%d1%82","status":"publish","type":"post","link":"http://wordpress.loc/?p=160","title":"Что такое статический сайт?","excerpt":"<p>Если набрать в поисковике Что такое статический сайт, то первое, что выпадет будет статья из Википедии, которая гласит: Статический сайт&nbsp;—&nbsp;сайт, состоящий из статичных html (htm, dhtml, xhtml) страниц, составляющих единое целое. Содержит в себе (в виде HTML-размеченных) текст, изображения, мультимедиа содержимое (аудио, видео) и HTML-теги. Теги бывают как служебные, предназначенные для обозревателя, так и предназначенные [&hellip;]</p>\n","excerptProtected":false,"content":"\n<p>Если набрать в поисковике <em>Что такое статический сайт</em>, то первое, что выпадет будет статья из Википедии, которая гласит: </p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p><strong>Статический сайт</strong>&nbsp;—&nbsp;<a href=\"https://ru.wikipedia.org/wiki/%D0%A1%D0%B0%D0%B9%D1%82\">сайт</a>, состоящий из статичных html (htm, dhtml, xhtml) страниц, составляющих единое целое. Содержит в себе (в виде HTML-размеченных) текст, изображения, мультимедиа содержимое (аудио, видео) и HTML-теги. Теги бывают как служебные, предназначенные для обозревателя, так и предназначенные для размещения, формирования внешнего вида и отображения информации. Все изменения на сайт вносятся в&nbsp;<a href=\"https://ru.wikipedia.org/wiki/%D0%98%D1%81%D1%85%D0%BE%D0%B4%D0%BD%D1%8B%D0%B9_%D0%BA%D0%BE%D0%B4\">исходный код</a>&nbsp;документов (страниц) сайта, для чего необходимо иметь доступ к файлам на веб сервере.</p></blockquote>\n\n\n\n<p>Это определение не совсем корректно, на сегодняшний день. Для статического сайта, достаточно облачных ресурсов ( по расходам и ресурсам ) и без необходимости, держать веб сервер. Веб сервер достаточно дорогая услуга, чтобы всего лишь, разместить фронтенд код клиентской части приложения. Но ограниченная по количеству памяти и прочих ресурсов услуга веб сервера, уступает облачному хранилищу, в масштабируемости, в случае высокого request per seconds (RPS)  пользователей на сайт. Может расстраивать необходимостью повышать мощности железа и более дорогой услуге вебсервер.<br>Уже не говоря о том, что при спаде количества запросов <s>лишние</s> гигабайты обходятся не дешево. И тем более, не упоминая, что фронтенд и бекенд надо держать отдельно, чтобы случайно не перемешать их так, как потом не сможет и программист со стажем установить, без с его создателя.</p>\n\n\n\n<p><br>Ситуация с <em><strong>облачным хранилищем</strong></em> намного иная, при увеличении количества запросов в секунду, облачный сервер просчитывает статистику, и в случае необходимости, расширяет облако, которое в огромном облаке. Это как огромные веб-сервера, а фронтенд лучше доверить надежному серверу.</p>\n\n\n<p>Но, эта ситуация актуальна только для статического сайта&#8230;<br />\nПравда, React превращает статический сайт во фронтенд часть современного веб приложения!</p>\n\n\n\n<p>А для бэкенда брать сервер наполовину легче и ничего лишнего, и пишите бекенд. По деньгам, получается лучше, и по безопасности надежней. Серверы, которые выделяются на облачные хранилища, в крупных компаниях, програмируются лучшими мастерами своего дела, но не самоучками  и прототиперами. </p>\n\n\n\n<p>Поэтому,  в понятие <strong>Статический сайт </strong>вкладывать не только <em>просто</em> файлы, которые загружаются пользователям на устройства и изменить их мы можем только на сервере, где они лежат, или одной коммандой скинуть в ковш <code>build</code> код, &#8212; <em>говоря &#171;облачным&#187; языком</em>.</p>\n\n\n\n<p>А также несет и <strong>клиентские части</strong> веб приложения, запрограммируемые под взаимодействие с бекенд-сервером.</p>\n\n\n\n<p>React основную работу по рендерингу приложения встраивает в <code>webworkers</code>  это стреда в уровне рабочего файла, который забирает самую сложную работу и выполняет её на ресурсах операционной системы пользователя. Тем самым, снижая нагрузку с приложения.</p>\n\n\n\n<p style=\"text-align:right\">Этого должно быть достаточно, чтобы сделать поправку в определение &#171;Статический сайт&#187;, и назвать его <strong><em><a href=\"/post:160\">&#171;Современный статический сайт&#187;</a></em></strong> © </p>\n\n\n\n<p> </p>\n","contentProtected":false,"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","template":"","meta":[],"_links":{"self":[{"href":"http://wordpress.loc/index.php?rest_route=/wp/v2/posts/160"}],"collection":[{"href":"http://wordpress.loc/index.php?rest_route=/wp/v2/posts"}],"about":[{"href":"http://wordpress.loc/index.php?rest_route=/wp/v2/types/post"}],"author":[{"embeddable":true,"href":"http://wordpress.loc/index.php?rest_route=/wp/v2/users/1"}],"replies":[{"embeddable":true,"href":"http://wordpress.loc/index.php?rest_route=%2Fwp%2Fv2%2Fcomments&post=160"}],"version-history":[{"count":15,"href":"http://wordpress.loc/index.php?rest_route=/wp/v2/posts/160/revisions"}],"predecessor-version":[{"id":290,"href":"http://wordpress.loc/index.php?rest_route=/wp/v2/posts/160/revisions/290"}],"wp:attachment":[{"href":"http://wordpress.loc/index.php?rest_route=%2Fwp%2Fv2%2Fmedia&parent=160"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http://wordpress.loc/index.php?rest_route=%2Fwp%2Fv2%2Fcategories&post=160"},{"taxonomy":"post_tag","embeddable":true,"href":"http://wordpress.loc/index.php?rest_route=%2Fwp%2Fv2%2Ftags&post=160"}],"curies":[{"name":"wp","href":"https://api.w.org/{rel}","templated":true}]},"error":0,"sticky":false,"format":"standard","tags":[],"categories":[16]}